app/Http/Livewire/Convertir.php

SELECT * FROM "cryptos"
---
    public function render()
    {
        return view ('livewire.convertir', [
            'cryptos' => Crypto::all()
        ]);