app/Http/Livewire/Recibir.php

    public function render()
    {
        return view('livewire.recibir', [
            'cryptos' => Crypto::all()
        ]);
---
SELECT * FROM "cryptos"