app/Http/Livewire/Vender.php

    public function render()
    {
        return view ('livewire.vender', [
            'cryptos' => Crypto::all(),
            'fiats' => Fiat::all(),

        ]);
---
SELECT * FROM "cryptos"
SELECT * FROM "fiats"

    public function updatedcrypto1($crypto_id){
        $this->nombre1 = Crypto::select('abr')->where('id','=', $crypto_id)->get();
---
SELECT "abr" FROM "cryptos" WHERE "id" = '1'