app/Actions/Fortify/CreateNewUser.php

    public function create(array $input)
    {
        Validator::make($input, [
            'nombre' => ['required', 'string', 'max:255'],
            'apellidos' => ['required', 'string', 'max:255'],
            'nickname' => ['required', 'string', 'min:6', 'max:30'],
            'email' => ['required', 'string', 'email', 'max:255', 'unique:users'],
            'password' => $this->passwordRules(),
            'terms' => Jetstream::hasTermsAndPrivacyPolicyFeature() ? ['accepted', 'required'] : '',
        ])->validate();

        return User::create([
            'nombre' => $input['nombre'],
            'apellidos' => $input['apellidos'],
            'email' => $input['email'],
            'nickname' => $input['nickname'],
            'password' => Hash::make($input['password']),
        ]);
---
INSERT INTO "users" ("nombre", "apellidos", "email", "nickname", "password", "updated_at", "created_at") VALUES ('prueba', 'prueba', 'prueba@gmail.com', 'prueba', '$2y$10$nRUp8x2NaoSvtObUETuZs.uUV40Jr/0NG3N5fNzCJ7rjBSxy6jARK', '2022-06-03 14:57:37', '2022-06-03 14:57:37') returning "id"