app/Actions/Fortify/UpdateUserProfileInformation.php

UPDATE "users" SET "profile_photo_path" = 'profile-photos/dDx9Oy8Nyesp0nZNEPShufzvFmmI4CaVt870P0bR.png', "updated_at" = '2022-06-03 08:15:50' WHERE "id" = 4
---
    public function update($user, array $input)
    {
        Validator::make($input, [
            'nombre' => ['required', 'string', 'max:255'],
            'email' => ['required', 'email', 'max:255', Rule::unique('users')->ignore($user->id)],
            'photo' => ['nullable', 'mimes:jpg,jpeg,png', 'max:1024'],
        ])->validateWithBag('updateProfileInformation');

        if (isset($input['photo'])) {
            $user->updateProfilePhoto($input['photo']);