app/Http/Controllers/CarteraController.php

SELECT max("id") as aggregate FROM "cryptos"
SELECT * FROM "cryptos" WHERE "cryptos"."id" = 1 LIMIT 1
INSERT INTO "carteras" ("nombre", "user_id", "direccion_id", "updated_at", "created_at") VALUES ('prueba', 1, 1, '2022-06-06 16:28:33', '2022-06-06 16:28:33') returning "id"
SELECT max("id") as aggregate FROM "fiats"
INSERT INTO "cartera_fiats" ("user_id", "fiat_id") VALUES (1, 1) returning "id"
SELECT * FROM "fiats" WHERE "fiats"."id" = 1 LIMIT 1
---
    public function crear_carteras($usuario)
    {
        //Cambiar hash por un UUID con algoritmo sha256
        $hash = array();

        for ($i = 1; $i <= DB::table('cryptos')->max('id'); $i++) {
            array_push($hash, (hash('sha256', (time() + rand(1, 10000)))));
        }

        $indice_mayor_hash = array_key_last($hash);

        for ($i = 0; $i <= $indice_mayor_hash; $i++) {
            $direccion = Direccion::create([
                'direccion' => $hash[$i],
                'crypto_id' => Crypto::find($i + 1)->id,
                'user_id' => $usuario->id,
            ]);

            Cartera::create([
                'nombre'  => $usuario->nickname,
                'user_id' => $usuario->id,
                'direccion_id' => $direccion->id,
            ]);
        }
        for ($i = 0; $i < DB::table('fiats')->max('id'); $i++) {
            CarteraFiat::create([
                'user_id' => $usuario->id,
                'fiat_id' => Fiat::find($i + 1)->id,
            ]);

SELECT "cantidad" FROM "carteras" inner join "direcciones" on "carteras"."direccion_id" = "direcciones"."id" inner join "cryptos" on "cryptos"."id" = "direcciones"."crypto_id" WHERE "carteras"."user_id" = 1 and "cryptos"."abr" = 'BTC' LIMIT 1
---
    public function visualizar()
    {
        $total = 0;
        $total_cryptos = 0;
        $total_fiats = 0;
        $cryptos = DB::table('carteras')
            ->select('cryptos.abr', 'carteras.cantidad')
            ->join('direcciones', 'direcciones.id', '=', 'carteras.direccion_id')
            ->join('cryptos', 'cryptos.id', '=', 'direcciones.crypto_id')
            ->where('carteras.user_id', '=', Auth::user()->id)
            ->get();




        $fiat = DB::table('fiats')
            ->select('fiats.divisa', 'cartera_fiats.cantidad')
            ->join('cartera_fiats', 'fiats.id', '=', 'cartera_fiats.fiat_id')
            ->where('cartera_fiats.user_id', '=', Auth::user()->id)
            ->get();

SELECT "abr" FROM "cryptos" WHERE "id" = '1'
---
    public function vender(Request $request)
    {

        $validated = $request->validate([
            'cantidad' => 'required|max:255',
            'cryptoid' => 'required',
        ]);

        $cantidad = $validated['cantidad'];
        $cryptoid = $validated['cryptoid'];
        $binance = new PreciosController();

        if ($cantidad <= 0 || !is_numeric($cantidad)) {
            return redirect('/cartera/vender')->withErrors('No puedes vender 0 o menor que 0');
        }

        $abr = Crypto::select('abr')
            ->where('id', '=', $cryptoid)
            ->first();