app/Http/Controllers/CarteraController.php

    public function visualizar(){

        $cryptos = DB::table('carteras')
        ->select('cryptos.abr','carteras.cantidad')
        ->join('direcciones','direcciones.id','=','carteras.direccion_id')
        ->join('cryptos','cryptos.id','=','direcciones.crypto_id')
        ->where('carteras.user_id','=',Auth::user()->id)
        ->get();


        $fiat = DB::table('fiats')
        ->select('fiats.divisa','cartera_fiats.cantidad')
        ->join('cartera_fiats','fiats.id','=','cartera_fiats.fiat_id')
        ->where('cartera_fiats.user_id','=', Auth::user()->id)
        ->get();
---
SELECT "cryptos"."abr", "carteras"."cantidad" FROM "carteras" inner join "direcciones" on "direcciones"."id" = "carteras"."direccion_id" inner join "cryptos" on "cryptos"."id" = "direcciones"."crypto_id" WHERE "carteras"."user_id" = 1