app/Http/Controllers/StripeController.php

    public function stripePost(Request $request)
    {

        $binance = new PreciosController();
        $precio = $binance->precio($request->abr . 'EUR');
        Stripe\Stripe::setApiKey(env('STRIPE_SECRET'));
        Stripe\Charge::create ([

                "amount" => (float) $precio['price'] * 100,
                "currency" => "eur",
                "source" => $request->stripeToken,
                "description" => "Esta pago es prueba"
        ]);

        Session::flash('success', 'Pago realizado con éxito');


        $cantidadActual = Cartera::select('carteras.cantidad')
        ->join('direcciones','carteras.direccion_id','=','direcciones.id')
        ->where('carteras.user_id','=', Auth::user()->id)
        ->where('direcciones.crypto_id', '=', $request->crypto_id)->get();


        Cartera::select('carteras.cantidad')
        ->join('direcciones','carteras.direccion_id','=','direcciones.id')
        ->where('carteras.user_id','=', Auth::user()->id)
        ->where('direcciones.crypto_id', '=', $request->crypto_id)
        ->update(['carteras.cantidad' => $cantidadActual[0]->cantidad + $request->cantidad]);
---
UPDATE "carteras" SET "cantidad" = '1.5', "updated_at" = '2022-06-06 10:01:48' WHERE "ctid" in (SELECT "carteras"."ctid" FROM "carteras" inner join "direcciones" on "carteras"."direccion_id" = "direcciones"."id" WHERE "carteras"."user_id" = 1 and "direcciones"."crypto_id" = '1')
SELECT "carteras"."cantidad" FROM "carteras" inner join "direcciones" on "carteras"."direccion_id" = "direcciones"."id" WHERE "carteras"."user_id" = 1 and "direcciones"."crypto_id" = '1'

    public function stripePost1(Request $request)
    {
        Stripe\Stripe::setApiKey(env('STRIPE_SECRET'));
        Stripe\Charge::create ([

                "amount" => $request->cantidad * 100,
                "currency" => "usd",
                "source" => $request->stripeToken,
                "description" => "Retirada de dinero"
        ]);

        Session::flash('success', 'Payment successful!');


        $efectivo = CarteraFiat::select('cantidad')
                    ->where('user_id', '=', Auth::user()->id)
                    ->get();
---
SELECT "cantidad" FROM "cartera_fiats" WHERE "user_id" = 1