app/Http/Controllers/UsuarioController.php

SELECT * FROM "users" LIMIT 5 offset 0
SELECT count(*) as aggregate FROM "users"
---
    public function index(){
        $datos = User::paginate(5);

SELECT * FROM "users" WHERE "users"."id" = '1' LIMIT 1
SELECT "users"."nombre", "users"."apellidos", "users"."nickname", "users"."email", "carteras"."cantidad", "cryptos"."abr" FROM "users" inner join "carteras" on "carteras"."user_id" = "users"."id" inner join "direcciones" on "carteras"."direccion_id" = "direcciones"."id" inner join "cryptos" on "cryptos"."id" = "direcciones"."crypto_id" WHERE "users"."id" = 1
SELECT "cantidad" FROM "cartera_fiats" WHERE "user_id" = 1
---
    public function edit($id){

        $usuario = User::findOrFail($id);

        $informacionUsuario = DB::table('users')
        ->select('users.nombre','users.apellidos','users.nickname', 'users.email','carteras.cantidad','cryptos.abr')
        ->join('carteras','carteras.user_id', '=', 'users.id')
        ->join('direcciones', 'carteras.direccion_id', '=', 'direcciones.id')
        ->join('cryptos','cryptos.id', '=', 'direcciones.crypto_id')
        ->where('users.id', '=', $usuario->id)
        ->get();

        $dineroUsuario = DB::table('cartera_fiats')
        ->select('cantidad')
        ->where('user_id', '=', $usuario->id)
        ->get();

UPDATE "users" SET "nombre" = 'prueba', "apellidos" = 'prueba', "email" = 'prueba@gmail.com', "nickname" = 'prueba', "updated_at" = '2022-06-03 16:55:12' WHERE "id" = '1'
SELECT count(*) as aggregate FROM "cryptos"
UPDATE "carteras" SET "cantidad" = '0.05', "updated_at" = '2022-06-03 16:55:12' WHERE "ctid" in (SELECT "carteras"."ctid" FROM "carteras" inner join "direcciones" on "direcciones"."id" = "carteras"."direccion_id" inner join "cryptos" on "cryptos"."id" = "direcciones"."crypto_id" WHERE "carteras"."user_id" = '1' and "cryptos"."abr" = 'BTC')
UPDATE "cartera_fiats" SET "cantidad" = '50' WHERE "cartera_fiats"."user_id" = '1'
---
    public function update(Request $request, $id){
        $datosUsuario = request()->except(['_token','_method','BTC','ETH','ADA','BNB','EUR']);

        User::where('id', '=', $id)->update($datosUsuario);

        $cryptosUsuario = request()->except(['_token','_method','nombre','apellidos','email','nickname','EUR']);

        $cantidadCryptos = DB::table('cryptos')->count();;


        for ($i=0; $i <= $cantidadCryptos-1 ; $i++) {
            Cartera::select('carteras.cantidad', 'cryptos.abr')
            ->join('direcciones','direcciones.id', '=','carteras.direccion_id')
            ->join('cryptos','cryptos.id','=', 'direcciones.crypto_id')
            ->where('carteras.user_id','=',$id)
            ->where('cryptos.abr','=', array_keys($cryptosUsuario)[$i])
            ->update(['carteras.cantidad' => $cryptosUsuario[array_keys($cryptosUsuario)[$i]]]);
        }

        $dineroUsuario = request()->except(['_token','_method','BTC','ETH','ADA','BNB','nombre','apellidos','email','nickname']);

        CarteraFiat::where('cartera_fiats.user_id','=', $id)
        ->update(['cantidad' => $dineroUsuario['EUR']]);