app/Providers/AppServiceProvider.php

    public function boot(UrlGenerator $url)
    {
        view()->composer('*', function($view){
            $id = Auth::id();
            View::share('img', User::select('profile_photo_path')->where('id', '=', $id)->get());
        });
---
SELECT * FROM "users" WHERE "id" = 1 LIMIT 1
SELECT "profile_photo_path" FROM "users" WHERE "id" IS NULL